Reports/ОтчетКладовщикаНаОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетКладовщикаНаОтгрузке</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикДолгосрок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгосрок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заморозка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Овощи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Охлажден</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хлеб</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Молочка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штучный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мелкошт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сухой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тилси</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолгосрокСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаморозкаСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОвощиСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОхлажденСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХлебСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МолочкаСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтучныйСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СухойСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МелкоштСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТилсиСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сетки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикЗаморозка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикОвощи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикОхлажден</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикХлеб</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикМолочка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикШтучный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикМелкошт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикСухой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикТилси</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутДоп</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кондитер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КондитерСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикКондитер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дневной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДневнойСтатус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектовщикДневной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОтчетКладовщикаНаОтгрузке/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать()
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить(НСтр("ru = 'Выберите организацию'"));
		Возврат;
	КонецЕсли; 
	Если Элементы.Маршруты.ТекущиеДанные=Неопределено Тогда
		СформироватьСервер();
	Иначе	
		СформироватьСерверСТекСтрокой();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СформироватьСерверСТекСтрокой()
	СоотСборщиков=Новый Соответствие;	
	//Результат.Очистить();
	ТЗ=Отчеты.ОтчетКладовщикаНаОтгрузке.СформироватьОтчет(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Склад,ОтборСтатус,СоотСборщиков,"",Организация.Код);
	Если ЗначениеЗаполнено(ТекМаршрут) Тогда
		Сч=-1;
		Инд=-1;
		Для каждого Стр Из ТЗ Цикл
			Сч=Сч+1;
			Если Стр.Маршрут=ТекМаршрут Тогда
				Инд=Сч;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		Если Инд>=0 Тогда
		    СтрокаВыгруженнойТаблицы = ТЗ.Получить(Инд);
			
		    ИндексСтрокиПослеСортировки = ТЗ.Индекс(СтрокаВыгруженнойТаблицы);
		    
		    Отчет.Маршруты.Загрузить(ТЗ);
		    
		    СтрокаКоллекции = Отчет.Маршруты.Получить(ИндексСтрокиПослеСортировки);
		    Элементы.Маршруты.ТекущаяСтрока = СтрокаКоллекции.ПолучитьИдентификатор();
		Иначе
			Отчет.Маршруты.Очистить();	
			Для каждого Стр Из ТЗ Цикл
				НовСтр=Отчет.Маршруты.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			КонецЦикла; 
		КонецЕсли; 
	Иначе
		Отчет.Маршруты.Очистить();	
		Для каждого Стр Из ТЗ Цикл
			НовСтр=Отчет.Маршруты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		КонецЦикла; 
	КонецЕсли; 

                                    
КонецПроцедуры    

&НаСервере
Процедура СформироватьСервер()
	СоотСборщиков=Новый Соответствие;	
	//Результат.Очистить();
	ТД=Отчеты.ОтчетКладовщикаНаОтгрузке.СформироватьОтчет(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Склад,ОтборСтатус,СоотСборщиков,"",Организация.Код);
	//ТД=СформироватьОтчет(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Склад,ОтборСтатус,СоотСборщиков);
	Отчет.Маршруты.Очистить();	
	Для каждого Стр Из ТД Цикл
		НовСтр=Отчет.Маршруты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла; 
	//Результат.Вывести(ТД);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если ЗначениеЗаполнено(Элементы.Маршруты.ТекущиеДанные.Магазин) Тогда
		//ТД=СформироватьОтчетПоПаллетамПоМагазину(Период.ДатаНачала,Период.ДатаОкончания,ЗначРекв(Склад,"Код"),Элементы.Маршруты.ТекущиеДанные.Магазин);
		//ТД.Область(,1,,1).ШиринаКолонки=20;
		//ТД.Область(,3,,3).ШиринаКолонки=15;
		//ТД.Область(,5,,5).ШиринаКолонки=15;
		//ТД.Область(,6,,6).ШиринаКолонки=5;
		//ТД.Область(,4,,4).ШиринаКолонки=5;
		//ТД.Показать();
		Парам=Новый Структура("ДатаНачала,ДатаОкончания,СкладКод,Магазин,Расщифровка",Период.ДатаНачала,Период.ДатаОкончания,ЗначРекв(Склад,"Код"),Элементы.Маршруты.ТекущиеДанные.Магазин,Истина);
		ОткрытьФорму("Отчет.ОтчетПоПаллетамОтгрузка.Форма.ФормаОтчета",Парам,ЭтаФорма,Новый УникальныйИдентификатор);
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначРекв(Ссылка,Рекв)
	Возврат Ссылка[Рекв];
КонецФункции // ()
 

&НаСервереБезКонтекста
Функция СформироватьОтчетПоПаллетамПоМагазину(ДатаНачала,КонецПериода,СкладКод,Магазин)
	Отчет=Отчеты.ОтчетПоПаллетам.Создать();
   
    ДатаНач=Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
    ДатаНач.Значение=(ДатаНачала);
    ДатаНач.Использование=истина;
	
    ДатаКон=Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
    ДатаКон.Значение=(КонецДня(КонецПериода));
    ДатаКон.Использование=истина;
	
    ПарамСклад=Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Склад");
    ПарамСклад.Значение=(Справочники.СтруктурныеЕдиницы.НайтиПоКоду(СкладКод));
    ПарамСклад.Использование=истина;
	
    ПарамМаг=Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТТ");
    ПарамМаг.Значение=(Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию(Магазин));
    ПарамМаг.Использование=истина;	
	
	СхемаКомпоновкиДанных=Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    //Из схемы возьмем настройки по умолчанию
   
    //А как здесь передать мои только что установленные настройки?
    Настройки=Отчет.КомпоновщикНастроек.ПолучитьНастройки();
   
    //Помещаем в переменную данные о расшифровке данных
    ДанныеРасшифровки=Новый ДанныеРасшифровкиКомпоновкиДанных;
    //Формируем макет, с помощью компоновщика макета
    КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
    //Передаем в макет компоновки схему, настройки и данные расшифровки
    МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    //Выполним компоновку с помощью процессора компоновки
    ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
                                                  
    Результат=Новый ТабличныйДокумент;
    ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.Вариант=ВариантСтандартногоПериода.Завтра;
	ПодключитьОбработчикОжидания("Сформировать",60);
	Автообновление=Истина;
КонецПроцедуры

&НаКлиенте
Процедура Отборы(Команда)
	Элементы.Группа2.Видимость=Не Элементы.Группа2.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура АвтообновлениеПриИзменении(Элемент)
	Если Автообновление Тогда
		ПодключитьОбработчикОжидания("Сформировать",60);
	Иначе	
		ОтключитьОбработчикОжидания("Сформировать");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыПриАктивизацииСтроки(Элемент)
	Если Элементы.Маршруты.ТекущиеДанные<>Неопределено Тогда
		НомСтр=Элементы.Маршруты.ТекущиеДанные.НомерСтроки-1;
		ТекМаршрут=Элементы.Маршруты.ТекущиеДанные.МаршрутДоп;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	Отчет.Маршруты.Очистить();
	ТЗКат=Отчеты.ОтчетКладовщикаНаДебаркадере.ПолучитьТабКатегорий(Склад);
	Для каждого Эл Из Элементы.Маршруты.ПодчиненныеЭлементы Цикл
		Для каждого Стр Из ТЗКат Цикл
			Если Найти(Эл.Имя,Стр.Поиск)>0 И НЕ Найти(Эл.Имя,"Статус")>0 Тогда
				Эл.Видимость=Истина;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 

	
	Если НЕ Организация=Справочники.Организации.НайтиПоКоду("000000009") Тогда
		ТЗКат1=Новый ТаблицаЗначений;
		ТЗКат1.Колонки.Добавить("Группа");
		ТЗКат1.Колонки.Добавить("Поиск");
		ТЗКат1.Колонки.Добавить("ПоискДоп");
		
		
		НовСтр=ТЗКат1.Добавить();
		НовСтр.Группа="Тилси";
		НовСтр.Поиск="Тилси";
		НовСтр.ПоискДоп="";
		Для каждого Эл Из Элементы.Маршруты.ПодчиненныеЭлементы Цикл
			ФлСклад=Ложь;
			Для каждого СтрКат Из ТЗКат Цикл
				Если Найти(Эл.Имя,СтрКат.Поиск)>0 И НЕ Найти(Эл.Имя,"Статус")>0  Тогда
					ФлСклад=Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
			
			Если ФлСклад Тогда
				Фл=Ложь;
				Для каждого СтрКат Из ТЗКат Цикл
					Если Найти(Эл.Имя,СтрКат.Поиск)>0 И (СтрКат.Склад=Склад ИЛИ Не ЗначениеЗаполнено(СтрКат.Склад)) Тогда
						Фл=Истина;
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
				Если Не Фл Тогда
					Эл.Видимость=Ложь;
				КонецЕсли; 
			
				
			
			КонецЕсли; 
			
			Для каждого Стр Из ТЗКат1 Цикл
				Если Найти(Эл.Имя,Стр.Поиск)>0 Тогда
					Эл.Видимость=Ложь;
				Иначе
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	
	ИначеЕсли Организация=Справочники.Организации.НайтиПоКоду("000000009") Тогда
		ТЗКат.удалить(ТЗКат.Количество()-1);
		Для каждого Эл Из Элементы.Маршруты.ПодчиненныеЭлементы Цикл
			Для каждого Стр Из ТЗКат Цикл
				Если Найти(Эл.Имя,Стр.Поиск)>0 Тогда
					Эл.Видимость=Ложь;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 

		
	КонецЕсли; 


КонецПроцедуры


&НаКлиенте
Процедура Склад1ПриИзменении(Элемент)
	ОрганизацияПриИзмененииСервер();
КонецПроцедуры
